app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."completion_date" ASC
---
  def index
    @tasks = Task.all.order(:completion_date)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params[:id].to_i
    @task = Task.find_by(id: id)

INSERT INTO "tasks" ("name", "completion_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "fold clothes"], ["completion_date", "2018-09-29"], ["created_at", "2018-09-22 19:14:50.482248"], ["updated_at", "2018-09-22 19:14:50.482248"]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["completion_date", nil], ["description", ""], ["updated_at", "2018-09-22 19:15:02.763872"], ["id", 32]]
---
  def create
    # Task.new - the default HTTP verb is a post
    # how does it know which id it needs to save it to? .save it autogenerates an id
    # get variables that user inputed using params
    # @task = Task.new(name: params[:task][:name], completion_date: params[:task][:completion_date]) #instantiate a new task
    @task = Task.new(task_params) #task_params replaces info in the above line by calling the helper method below under private
    if @task.save # save returns true if the database insert succeeds #### creates an id
      redirect_to root_path # go to the index so we can see the task in the list
    else # save failed :(
      render :new # show the new task form view again, and all past entries create an id with nill
    end
  end

  # create blank table ### do not save here otherwise it will keep creating blank forms!
  def new
    @task = Task.new
  end

  def edit
    @task = Task.find(params[:id].to_i)
  end

  def update
    # does it know the id from the route? needs to find it that's why we use find_by
    # how do I know that the parems are keys in the page? we know the structure is a hash
    @task = Task.find_by(id: params[:id].to_i)
    @task.update(name: params[:task][:name], completion_date: params[:task][:completion_date], description: params[:task][:description])
    #redirect_to task_path
    # update is an inhered method? yes!
    # the following statement requires @task instead of :edit because :edit looks for a @task

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 25]]
---
    task = Task.find_by(id: params[:id].to_i)
    task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-09-21"], ["updated_at", "2018-09-21 22:46:22.024204"], ["id", 31]]
---
  def complete
    @task = Task.find_by(id: params[:id].to_i)
    if @task.completion_date == nil
      @task.completion_date = Date.today
      @task.save # only save it if you modified something

SELECT "tasks".* FROM "tasks"
---
  def all
    @tasks = Task.all